#include "date.h"

#include "gtest/gtest.h"

class DateTest : public ::testing::Test {
 public:
  void SetUp() {
    // code here will execute just before the test ensues
    first_day = Date(2018, 9, 4);
    last_day = Date(2018, 12, 11);
  }

 protected:
  Date first_day;  // first day of classes
  Date last_day;   // last day of classes
};

TEST_F(DateTest, PrintDateTests) {
  Date y2k(1999, 12, 31);           // y2k
  Date ind_day(1776, 7, 4);         // US Independence
  Date best_holiday(2018, 10, 31);  // Halloween

  std::string expected_out_1 = "1999-12-31\n";
  std::string expected_out_2 = "1776-07-04\n";
  std::string expected_out_3 = "2018-10-31\n";

  testing::internal::CaptureStdout();
  y2k.PrintDate(true);
  std::string output1 = testing::internal::GetCapturedStdout();

  testing::internal::CaptureStdout();  // You must do this EVERY TIME, or else
                                       // it will segfault
  ind_day.PrintDate(true);
  std::string output2 = testing::internal::GetCapturedStdout();

  testing::internal::CaptureStdout();
  best_holiday.PrintDate(true);
  std::string output3 = testing::internal::GetCapturedStdout();

  EXPECT_EQ(output1, expected_out_1);
  EXPECT_EQ(output2, expected_out_2);
  EXPECT_EQ(output3, expected_out_3);
}

TEST_F(DateTest, PrintDateTestsWithoutNewline) {
  Date y2k(1999, 12, 31);           // y2k
  Date ind_day(1776, 7, 4);         // US Independence
  Date best_holiday(2018, 10, 31);  // Halloween

  std::string expected_out_1 = "1999-12-31";
  std::string expected_out_2 = "1776-07-04";
  std::string expected_out_3 = "2018-10-31";

  testing::internal::CaptureStdout();
  y2k.PrintDate(false);
  std::string output1 = testing::internal::GetCapturedStdout();

  testing::internal::CaptureStdout();
  ind_day.PrintDate(false);
  std::string output2 = testing::internal::GetCapturedStdout();

  testing::internal::CaptureStdout();
  best_holiday.PrintDate(false);
  std::string output3 = testing::internal::GetCapturedStdout();

  EXPECT_EQ(output1, expected_out_1);
  EXPECT_EQ(output2, expected_out_2);
  EXPECT_EQ(output3, expected_out_3);
}

/**
 *
 * Note, this is the only provided test case which actually uses our test
 * fixture
 *
 * However, it is illegal to mix TEST() and TEST_F() in the same test case
 * (file).
 *
 */

TEST_F(DateTest, DaysBetweenTests) {
  EXPECT_EQ(first_day.GetUsDate(), "09-04-2018")
      << "First day of class not setup properly";
  EXPECT_EQ(last_day.GetUsDate(), "12-11-2018")
      << "Last day of class not setup properly";
  EXPECT_EQ(first_day.DaysBetween(last_day), 98)
      << "Days between is not calculated properly";
}

/**
 *
 * NOPE!  Can't test PRIVATE methods
 *
 */
/*
TEST(DateTest, ConvertFromDays) {
        Date convert_first_day = ConvertToDays(2458365);
        EXPECT_STREQ(convert_first_day.GetUsDate(), "09-04-2018");
}
*/

int main(int argc, char* argv[]) {
  int pid = ::getpid();
  std::cout << pid << std::endl;

  for(auto& s : std::vector<char*>(argv, argv + argc)) {
    std::cout << s << std::endl;
  }

  std::string current_exec_name = argv[0];
  if (current_exec_name != "./out/date_unittest_correct") {
    throw std::runtime_error("Į̶̧̢̨̡̨̧̨̨̡̧̧̨̢̡̡̨̛̛̛̻̤̟̠͍̥͎̳̮̫̪͎̜̹͔̫̱̘̼̺̝͔̯̰̤̟̝̗͕̥͇̞̻̙̥͔̞̘̣͔̰͚̙̗̮̪̩̬̭̖̣̟̤͇͉̯͚̹̫̭͍͓̺̞͍̞̺̗͇̣̗̬̩̲͓̙̥̙̖̦̩̞͎͓̞̝̤̟̝͎̝͚̝̫͉̘̩̞̰̜̙̗̮͉͍͚͇̖̼̩̤͓̩͕̮̰̦͈͔̘̯͔̮̯͓̬͎̝̫̬͈̭̭̯͎̭͍̝̪̮̦̠̻͚͍̺̫̲̥̬̹̹̖͍̼͓̫̫̗̯͓̩̔̈́̿̾̓͛̃͋̂́̍̄̇̀̿̓͗̇̎̽̆́͋̋͒̓͊̊́̈́̈́̍͑͗̎͐̎̿͂͂͑̏̽̈́̏̊̔̃͒̽̿̑̇̊̐̎̉̔͐̂̎̎͌͋̀́̀́̈̽̎̓̋̀̓̋͒͛̔͒̈̔́̿̓̊͌̄̅͐̏̋̈́̂̇̇̄̋̀̽͋͐̉͛̀̑̄̄̂̀̓̃͌͊͂̌͗̇̍̽̓̀͐̈́̑̈́̀͆͑͊̈́̎̃̔̈́̄͌͛̎͆̎̔̈́̾͋̎̽̓͋́̔̈͛͗͋͌̔͆̄̔̔̈́̈́̎̄͂̍́̈́̀́̑̔́̊̇̇̈͗̉́̋̽̎̐̏͘̚͘̕͘̚͘̚̚͘̕͘̚͘̚͜͜͜͜͝͝͝͝͝͠͝͝͝͝͝͝͝͝ͅͅͅͅͅͅͅͅ'̵̡̡̢̧̦̥̯̝̣͔͎̠̳̹̲̪̰̺̼͚̥͖̝̤̱̺̜͕̞̪͕͉̞͍͚̦̻̤̳̞̲̞̮̱̯̜̬͙̝͉͉͎̭͖̙̫̪͎͛̂̈̇̒̃̎̈́̌̔̔̿̾̋̀̆̐͊̀͗̕̚̕̚̕͜͠͝m̷̡̛̛̛̗̙̹̞͚̝̣͓͚̍̿̌̒̃̃̒̽͋͒̃͐̉̅̈́̔͐́̉̓͌͗̃͋̾̀̃̾́̔͐͆̊͌͆̎̐̉̂̀͐̿͛̃͋̈́̈́̑́͊̓́͊͊͂̂͒̈͗̃̊̀̆̔͗̑̉̏͋̀̃̉͗̏̓̂̏̓̇̈́̀̏̌̔͐͗̊͒͒̍͌̍̈̎̽̽̇̎͋̈̾̇̃̀͂́̽̋̅̐͌͐͑̏̒͛͒̉̓̄̌̽͛̇͋̍̈́͛͐͊͊̾̅̋̒̈̂́̄̀̑̊̈̿́̐͂̑͗̈́̉̑͐̔͒̐́̽͗̄̀̾̂͐͛̚̚̕͘̚͘̕͘̚͘̚̕͝͝͝͝͠͝͝͠͝͠͠͝͝͝͠ ̵̧̧̡̡̧̢̡̧̨̨̧̡̧̧̧̧̛̛̩̬̩̩͍̙͉̻̬̞͎͈͙͓̦͎͔̘̯̥̝̭͚̬͕̦̭̣̹͖͕̤͚̻͚͕̤̪̳͓͔̣̙̞̱̞̞͔͙̬͖̖̺͉͍͇̠̰̘̝̠͙̤̙̰̙̦͚̲͙̖̠̥̣͇̬̲̠̦͕̭̬͔̞̤̜͔̤̝̝͔̳̙̻͕̥̳̭̼̦̖̠̗̞̼͙͙̦̮̞̝͖̖̙͎̫͚̱͖͕̮̗̦̻̭̥̝̬̻̠̘̙̮͕̬͓̖͖̰̹͇͕̦̠̹̭̙͕̘͎̲̥͕͚͖͍̤͕̩̤͉̱̥̞̤̱̲͓̤̣̙̥͖̭͔̼̗͖͙̝̙̳̟̫̘̖̺͉̞̤͇͍͈̻̬̯̝͔̦̥̣͓͉̙̾̋̈́̄̎͑͒̾̂͊̅̾̀͒͑̒̊̔͊́̄̎̈́̋̅́͊̏̓̽̾͌͛̃͂̌̌̂̀̊̾̓̀̐͐̽̉͑̇̊͂̇͋̈́̀͌̈́̚̕̕̚͜͜͜͜͜͜͝͝͠͝ͅͅͅͅͅͅͅą̵̨̛̛̻̠̮͍̖̩̞̰̬̲̱̪͍͈͍̳͇̩̞̹̳̬̣͖͓͔̯͎̏͑̅̓͋̄͌̍̏̏̐͆̈́̎̔̈́̉̉̏̋̿̽̎̇̌̿͌̀̎̚͘̕͜͜͝͝͠͠͝ͅ ̴̨̢̢̡̡̢̡̧̛̛̛̳̩̠̬͈̰̯̲̤͈̝̺͔͓̠͉̟̝̪̪̱͎̪̞͙̖͎̻̱͙͔̰͇̲̲̺̙͙̞̥͚͙̙̤͔̘͚̺̝̤̘̲̞̦̞̺̭̩̣̥̹̱̭̣̫̹̭͙̼͇̯̥͕͔̩͇͓̮̗͚̦̫̦͙̟̮̟͚̤̖͔͖̖̲̺̠̪̜̙͙̰̣̖̹̅͊͗̈́̽̈́̌̽̍̏̔̋̊̌̉̍̇̒͋͆̇́̇̈́̀͛̾̀̽̐̃̽͆̀̿̃̊̈̆̊̓̀̿͒̽̔̐̏͂́̈͌̎̃̓́̌̃̓̈́̂̈́̿̍̅͆̒͛͂̎̄͑̽̎̀͛̓̓̔͗̋̓̈́̀̾̑͑̈̿̊̉̉̓͗̾̾̂̐̅̑̇̈́͒͌̈̈́̍̉̾͊̋͑̀̿̇̏̍̔̾̾́̐͗̂̈́͗̅̀͑́͊̋̾͐̒̍̐̌̅̂̒̀̀̔͐̾͋̋̾͋͊͋͋̋͋͛͐̇͊́̇̍̉́̾͊͊̂̈́̏̅̆͊̉͑͌̀̈́̂́͒̔̈́̽̉͐̒͗̍̀̽̀̈̄̀̇͂̃̈́̎͑͌̕̕͘͘̚̚͘̕̕̕͘̚̕͘̕̚̕̕͜͜͝͝͝͠͝͠͝͠͝͝͠͝͝͝͝ͅͅͅm̵̧̡̨̧̡̡̨̛̛̛̛̟̬͇͖̰͇͖̣͕̠̦̗͎̼͍̩͚̦̯̝̲̱̺͎͉̙̩̰̰̮̣̤̘͕̯̺͓͎̣̪͔͔̦̺̬̩͕̻͚̣̪̺͔͓̗͚̬̝̦̺̙̞̻̣̭̫̱̥͙͔̦̱̲̜̩̳͉͙͇͂̊̾͂̂̏͛̀́̀̆̋̓͐̉͗̿̔͗̈́̆͐̈͒͆͗͊́̑̆̅̿̒̒̈́̈́͌̔̇͛͊̈́͆̈́̿̃̎̇́̽͗̓̓͑̀̂͒̋́̾̓̒̆̈̾̽́̍̉͂̈́̈́͛̓͒̽̏̈́͂̒̽͒́̆̂͌͗̈́̑̽̇̎̑̿̍́̔̃͋͛̀͗́͛̎̀̍̔̈́̓͂͗͐́̅̔̑͒̀͊͌͌̊͒̋̋̎̏̓̃̀̍̒͋̓̂̋̂͗̃̀͆͂̒̊͂̍͂̿̈́̎̌͆̌̾̍́̽̇͘͘̕̚̚͘͘͘͘͘̚̚̚͘̕͘̚͜͜͜͝͝͠͝͠͝͠͝ͅͅǔ̴̢̡̨̧̢̡̢̨̡̧̨̧̧̢̨̡̢̡̧̧̢̢̨̢̡͙̗͓͈͖̮̥̮͈͇̫̖̲͙͕̙̜̯̳̥̲̼̭̯̟͈͕̯̼̥̟̫̳̟͇̣̝͚̹̫̫͓̼̻͔̯̭̺̹̬͔̹̭̘̞͔̫̳̲̼͙̫͓͙̼̘̙̹̩̱̭̲͚͖̭͔̼̙̯͚̜̰̥̖̞̬̖̜̮͈͇͈͖̻̘̲̩͎̣̥̠̩̳͇̩̜͔̞̼̝͕͔͕͇͓̖̩͎̯̜̙̞̠̹͖̼̫̠͔̭͔̰̼̞̖̖͚͈̩̪͓̪͎̩͇̰̲̦͈̻͎̗̩͇̯̪̝̤̩̪̺̜͍̼̙̭͕̺̱̹̳̬̬̱̟̩̦̣͚̳̙͓̠̥̜̼̖̜̹͈̻͔̘̦̜̫̘̬̲̖̠͕͕̫̮̹̪̺̞͉̘͚̬̮͎̦̝̟͇͎̘̼͈̲̥̺̥̲̗̱̫̫̝̙̟̺̖̙͓̭̹̹͋͜͜͜͜ͅt̶̢̧̡̡̧̨̨̡̢̨̢̡͓͎̣̹̻̰̦̠̱̮͈̦͈̜̥̠̣̮̩̩̣̞̰͓̪̪͙̝͓̬̼̖̺̪͓̰̣͍̭̣͕̳͖̝̹͔̗̲̟̱̜͙̥̞̫̪̭͚̳̻̜̦̘͙̮̥͔̲͓͈̩̣̠̜̞̗̪̭̝͈̜͙̣͈̻̥͍̼͔͙̞̲̖̦̱̗͉̹̘̰̼͖̣̝̘̾̓͑̀́̍̒͋̔̑̐̒͛̾̆̒̓̓́͆̽̇̈́̓͗̉̐̇̈́̐̑͐́́͋̓͗̌̃͗̓̑͂́̋̀͗̐̓̄̅̓͒͐̈́͒̏̐̃̕͜͜͜͜͠ͅḁ̶̛̰̭̦͓͙͉̩̹͓͙͚̯̹͇̟̮̘̫͇̟͒̓͑̋̈́͒̃̓͐͒͑̍͆͑̎̃́̐͋́̈́͌͊̈́̓͒̑̓͊̽͒̏̒̎̏̎̂̑̈́̌̉̍͊̃̈́̆̒̓̑̄͛̈͒͒͂̒̈͆̐́̓̄̏̆̀͊̊̈́̋̇̓̓͘͘̕̚̚̕̚͠͝͠͠ͅͅn̴̡̧̧̢̢̨̧̢̨̡̡̢̡̧̨̡̢̛͎̬̺̤͚̙͈̰̠͇̖̼̱̰̼̠̗͇͎̻̠͉̱̮̝̘͉͚̭̜̻̖̰̤͓̱͕̫̣̪̙̲͉̦̮̬̲̼̩̭̰̻̰͚͔̙͎͍̼̘̰̟̝̗̮͈͎̬͍̭͎̦̞̣̗̯̳̹̥͉̱̯͈̬̘̬͓͈̼͉̠̙̙͚̣̠̗̤̟̪̣̪͕̞͓̟̞̩͇͚̠̻̳͇͎͙͚̟̜͈̻̦̣̭̻̬̟͖͓̠̘͈͎̤̤̗͙͓͈̖̟̫͎̟̩̮͔͓̹̬̬̗̻͚̗̪̝̜̟̰̼̳͔͎͚͍̫̘̥͇̦͓͚̖͉̙̮͍̰̯͊̀̐̒̐̆̀̓͒̎̎͌̎̄̓̈́̾͑͗̌͂̂̑͛̈̊̀̐̽̊̊̈̾́́͐̇̇̃̋̿̐̓̌̆̋͑̆̈̌̊́̈́̍͗̂̐̀̾̉͒́̓́͆͐̈͆͋̿͌̋̍̒̑̇̓̍̈́̐̈͆̐͑̎̐̉͑̌͂͘̕͘̚͘̚͘͜͜͜͜͝͝͠͠͝ͅͅͅt̷̨̨̢̨̢̢̨̢̧̧̢̡̧̨̡̛̛̛̛͙͖̦̖̮̜̠̹̰͖͇̯̘̹̗̝͙͇͇̲̗͎̰͖̲̭͔̹̲͙̘͖̠͙̯̰̰̩̱̳̱̝̦̯̠͎̠͎̲̝̫͈̗̬͚̻͕̬̲̯̰̺̳̝͙̜̮͇͔̝̠̣̘͉̭̹̼͔̠̗̬͙̣̳̬̮̖̥̩̺̬̪͓͔̪̟̐͒̍̊̐̎̇̌̎̈́̈͋̓̒̉̒̀̽̐͆̐̇̅̆̓͋̄̇̒̔̄͒̾̎̈́̇͛̈͆̃̈͑͑̊͌̿̔̅̈̋̍̍́̎͛͗́̍͑̇͆̌̀́́́̈́̄͛̉̎̇̉͊̀̏͑̈́̋̅̌̑̒͛͐̀̔̂̓̿̽͐̄̈͑̈́̒̌͒̾́͊̀̍̅͗̃̾͐͒̑͂̌̇́̌̏̃͒̎͑̐̄͑̒̈́̈̿͊̌̈́͗͊̀́͒̋͒̏̋͊̈̀͗̓̒͌̇͑̊͒̈́̾̈͋̑̈̉͑̒͂͂̌͑͛̉̆̆̒̈́̾̆̀͒̌̇͊̂̏͆͐̾͛̊̇͐͋̌̎̌́̓͛͒͊̓́͊̊͌̌̔̍͒̌̊̾͐̒̂̊̇͂͛̈̈́̓̉̉̓̆́͑̔̒̈́͗̑̒̔̂͑͗̈́̔̔̔͘̕̚͘͘̕̕̚̕̚̚̕͘̚̚̚͜͜͜͜͝͠͝͝͠͝͝͠͠͝͠͠͠͝͠͝͝͝͠͝ͅͅͅ,̴̡̧̨̧̢̨̡̢̡̢̢̡̛̛̛̛̛̛̛̝̼̝͓̖̦͓̳̜̻̞͖̯͕̹̟̥͓͈̙̱̟̟͙͓͕͈̺͔̱̥̜̜̼͉̬̥͚̘̺̬̜̫̝̻̼͉̘̳̥̙͎̥͍͉͔̰̰̬͙̬̳͎͖͕̬̯̪̪̤̙͙͖͕̱̳͖̬̺͕͙͎̜̘̳̭͔͖̜͇̯͔̝̰͉̥͔̤̭͉̩̺̻̥̜͉͙̤̗̼̬̦̼̠͍̮̜̫̲̪̘̻͓̻̼̥͙̠̘̮̟̯̘̜̰̭̳̠͖͉̬̹͇̣̬͙̦̰͚̠͉̪̬̠̠̤͉͍̣͓̲̫̜̰̝̲̠͇̖̳̙̝̭͓͓̹̜͉͇͔̞͈̝̯͎͍̩̭̝̥̎̏̏̓͐̽̐͆́̽̊͊̓̀̍́̑̇͊̀̃̐̅̾̐̾̍̑́͋͂̎̉̎̂́͗̊̅̑̂̾̽͂̇̎̋̈́̑̑͋̏̍͗͗͋́̈́̍͊͌̓͆͌̄̈́̓͐̍͋̅̈́͛̌͂̈̓̆͒̎̋́̈́̂̀̾̽̔̏͑̽̈̈͆̔͋̑̑̿̉͑͗͑̊̑̉͐̀̔̑̍͛̑̈́̌̈́̚̕̕̚͘̕͘͜͜͜͜͜͜͜͝͝͝͝ͅͅͅͅ ̴̨̢̡̡̡̨̨̛̛̛̣̙͔̣̮͈̘̲̗͇̠̻̰̘̭̙̜̠̦̪̝͓̟̱̺͉̩͇̺̮̭̮̥̫̭̻̲͇̜̩̻̭͉͚̯͕̩̝̟̠͓̪̯͙̟̟̺̱̯̝̺͈̩̙̞̺̱͇͎̜̬̘̥͍̩͔̗̲͉͙̘͇̣͈̭͉͌̿̈́̿͂͛̿͂̽́̆̆̀̋̎̔͜͜͝͠ͅͅͅͅk̴̡̢̡̨̡̡̧̧̨̧̨̛͖͙̥͔̳̲̩̼̠̣̩̻̣̱͔͓̹͉͙̰͕̫͚͔̟̺̝̦̰̪͓͚̹̮͙̮̤̞̰̞͙̖͙̠̥̼͙̙͙̻̮̭̺̝͙̭̲̥̤̪̱̹̟̗͉̰͇̟̻̮͓̘̝̼̭̭̱͍̺̖̬̹̖̥͚̝̙͚͔̺͇͖͓̹͚͙̗̼̖͔͉͇̻̣͙̣̫̼͙̣͉̥͙̙̖̗͉͎̙̳̖̳̻͔̰̘͕͓͎̼͈̟͚̲̝̣͙̙̠̱̖͓͚̖̺̗̞̜̬͖̺̫̪̺͓̜̼̬̱̣̤͚̩̗͍͓̺̭̣̹̺̭̍̈́͌̽̔̄̓͊̓̋͑̓͆̔̓̋͂̈́̔̿́̃̏̈́́̂̀́̒̽̄͂̔͗͊̽̆̀̾̃̋̐̈̍̎̋̿͑̈́͆͊̊̓̏̓͊̀̌̀̑͂͒̂̓̆̒̓͂̔̃̆̓̋̐͆͆̇̐͗̔̑̍̈́̑͊́͊̈́̓̋̃̀̏͐̉́̎̐̃̀̇͑̈́̈̆̍͋̋̓̏̏̊̆̅̃͒̈́́̍͗́̓͋̀̓̅͐̈̊̅̔̅̓̆͂͑̈͌̓̉̔̇̍͆̅̎̐̊͐̌͗̔͒͒͌́̎̈̄̂̿́͑̾̃͊̓̀͗̐̓̽̄̿̄̌͗̃͐̎͒̄̈́͆̓̉͌͂̽̄̾̊̂̓̓̍̏̐̔͆̈́͛̀̚͘͘̚̚̚̚̚̕͘̚̚͜͜͝͝͝͠͝͝͝͝͝͠͝͝͝͝͝͝ͅͅͅͅͅͅị̵̧̨̡̡̢̧̡̡̧̢̛̛̛̛̛̛̛̲̬̙̬̲̪̞̥̗̱̞̜̹͍͕̫͕̭̥̻̥͖͍̙̠͚͈̮̣̩̖̬̣̳͕̣̻͍͍̖̣̖͇͓͖̤͖̗͖̺̲̜͉͙͚͈͓͉̬͓̱͕̲͍͎͕͔͕̗͚͈̯̝̖͇̟͇̜͉̞̳͈̻̯̳̈̉̃̈̄́̔̆̉̽̈́̂͑̌̏̓̆̇̉͆͋͋̾̉̓̀͗̑̈́̀͌͛͗̑͋̈́̈̐͒̑͛̈́̔͗͗̆̔̇́͂͐̀̊̋͐́̐͊̊̓͌̒̀̃̀̄̿͆̍͑̽̀̿̓͐͛͋̀͆͂̉͗͐͂̂̑̅̑̄̎̍̇̂͛̂͊͒̿̇̊̋̋́̿̄͛̅͂̅͆̽̿͋̈́̆̋̿̀͛̔͋̍̈́̾̽̑̊̀͛͌̉́͑̀͂̈́̓̈́͐̈́̐̿͑̓̎̓̽͐̈̏̐͑̽̓͗͆̎̌͊̿̈́͗̈́̊̓̍̎̇̿̔̀̌́͋̆̓̊͗̆̈́̿̆͐̈́̀̈́̾͒̏̋̓̈́̆̆̀̑̾̓̏̔̋́̏͐̀̈́͌̋̆̊̾̍̓͂͂͐͐͐̀͗̇̚͘̚͘̚̕̚͘̚͘͘͘̚͘͘̕̚̕̕̚̚̚͜͜͜͜͠͠͠͠͝͠͝͝͝͝͝͠͠͠͠͝͝͝͝ͅľ̷̡̢̨̢̡̧̧̨̨̧̧̛̛̛̛̛̪̭̙̟̬̤̪͇̪͓̦̞͎̙̙͇̝̺͇̮̩̫̖̹̦̤̜̤̜̗̲͔̝̙̠̺̹̠̙̘̠̺̬̻̻͔̘͎͉̯̳͔̜̤͙̘̘̺̪̲͚̹̻̳̣̗̝̦͔̦̰͔̥̼͙̮̼̗̯̖̌́̑̑͌͑͛̄̔̌̀̂̈̇͊́̀͐̔̆̽́̋̿̈̍̊̋́͛̔͋̌̔̄̅̋͂͑̓̒͛̃̉͌͒̏͒̊͊́͛̐́́͗͗͆̅̇̔͗̽̊̀͒̓̍̍̀̄͂͆̑͆̂͑̄̋̒͐̌́̑́͋̄̀̏̓͐̐͌͒̀́̕̕͘͘͘̚͘͜͜͝͠͝͝͝͝l̵̢̡̧̧̨̧̡̧̧̡̢̡̢̨̢̡̨̢̨̡̛̛̛̖͕̰̻͕͇̫̣̣̖̤͚̞̩̺̦͇̘̩̺̼̯͍̝̙͖̳͕̭͖̣̞̮̣͖̤̙̳̳̱̞̖̪̝͈͚̤̯̹̼͇̻̪̱̜̖̖̠͔̙̤̣̙̹̬̥̱̳̹̮̲̦͖̠̖͚̳̗͕̠̬̼͕̥̣͉̞͕̬͙͕͓̰̫̗̯̞̻͖͓͓̰͍͉͔̼͚͍̳̗̞̞͎͎̩̝̮͔͙̤̮͖̭̯̣̣̠̠̗̰͕̣̘͕̜̘̼͎̹̝̗͍͎͖͉̯̖͍͉̬͔̪͔̬͖̘̖̞̰̰̩͈̗̳̣̰̞͍̜̰̠̭̳̬̖̮̟̣̻͙͔̰̜̩̠̩͎̥̜̜̣̼͇̜͙̦̻̹̤̯̯̼̗̞̯͕̝̦̭̪̬̲̮͖͚̠̻̪͇̮̩͔̬̼̳͚̟̭͈̤̫̻͚̳͍̬̙̘̦͖̜͉͎̣̹̙̼̤̠͍͉͓̹͉̤͕̮̮̦̟̘̬̱͉͇͖̣̇̊̐͂̐̑̑̍̊̏̑̈́̀̀͌̆̅̍͌͋̓͂̃̃͒̀͆͆́̉͛̓͛̓̓͑̍͗̆̈́̆̀̑́̇͗͋́̊̊͗̑́̾̋̑͗͌͂͑́́̈́̀̅̏͒̾̂̀̾͗̀̏̂̌̑̓̓̓̏̄̅̄̐̈́̂̃̔̈́͒̔̀́̐̄͋́̏̆̽̑͊̾̆̒̂́͛̊̏͋̆̉̅̅͗̇̏̉̏̿̊͛͗̈͊̆̒̊̄͐̄̓̋͑̋̒̎͋̔͆̐̽̏̀͆̔̒̄̀̇̄̈́̆͗̓̎͋̏̍͋̏̈́̎͊̓͛̈́͛̾͑̆͊̌̿̒̽̿́̇̀̇̓͊̀̆̀̂̄̄̈́̀̆͗̄́͒̅̓͑̆̈́̉͛̈́̏͗̚̚̚̚̚̕̚͘̚̚̚̚̕͘̚͜͜͜͜͜͜͝͝͠͠͝͠͝͝͝͠͝͝͠͝͝͠͝͝ͅͅͅͅͅ ̴̨̧̡̨̧̢̢̨̢̡̨̢̨̛̛͎̫̼͈̥̱̩̙̙͓̣͕̞͙̬̪͎̩͈̞͔̮̱̖̙̮͈̗̹̹̦̤͚̠͎̞͓̥͚͍̰̹͎̰̬̻̺͎̺̲̪̻͎̖̤̳̟͔͎̺̩͓̪̤͕̺̦͕̝̺͈̮̬̝̳̱̩͉͚͎̥͍̪͙̥͎̳͙̲̝̙̥̫͉͙͈̭̳͈̠̮̹̝̦̭͕̖͔͙̫͎̖͕͉̞̠̦̬͎͚̭͍̝̆̈̉͒̄̋̈̋̂̽̀̅͑̒͊́̔̈́̋́̄͛͛͂̆̎͋͂͒͑͗̈́͌͛͆͒͋͂͗̇̈́̈́̈̏͋̈̆́̆̏͛̉͑̂͒̄̃̾͌̊̾͋̾͗̄̎̔̅̈́̓̓͌̏̑̑̀͑͗̾̃͑͐͛̿̿͊͑̕̕̚͘̕͘̕̕̕͜͜͠͝͠͠͝͠͝͝ͅm̴̨̧̢̧̢̡̢̧̢̢̛̛̖͉̥̞̺̞͈̣̘̮̫̪̟͙̤̞̫̘̲͉̗̦̻̳̲͉̭̯͍̙̦̱͇͉̟̥̬̘̝̲͔̘͙̖̮̬͙̘͓͓̰̮̤̖̞͚̯̲̣̪̘̺̦̙̙̤̜͕͔̳͍̭̣̯̞̫̹̟̞̳̰̫͊̀̉̋̑͊͌̀̈́͑̐͐̔͂͊̒̍́͋̐́̋̂̆̈͋̒́̓̀̄̐͑̑̊̔̿͗̄̊̉̆̌̂͐͐̔̀͐̏̾̒̀̌̌̈́̔̔͋͊̑̿̇̀̎͋̈́̑̃̋̀̑̊̌̅͘̕̕͘͘͜͜͝͠͝͝͝ͅͅͅͅe̶̡̨̨̧̛̲͇̟̣̙̰̝̺͍͍̖̰̜͉̮͍̩̭̳̗̼̱̱̞̣͉͙̰̹̯͈̤̯̹̣̭͖̭͍̠̻̯̟͎͓̰̺̹̹̺͈̪̤͍͚̝̫̞͈̖͍̰͕̝̜̹͎̤͍̺̤͐̈́̋̈́̈̈́̎̄̒͐̒͆͐͒̓͗̓̓̑̍̐̏̾̆̒͋̆͒̆͐̌̈́̅͂͗͑̂͛̄̈́̈́̄̈́̎̓̈̔͌̇̐̾̍̑͆̇͛̐̔̏̄̓̑̂̆̾̆̌͊̿̇̑̓͊́̌́̄̏̒̄̚̚̕͘̚̕͠͠͝͠͠͝͝͠ͅͅͅͅ ̷̧̨̢̛̛̛̛̛̛̛͇̯̼͙̜̲̙̩̞̜̼̳̙̮̮̪̖̙͚̮͚̘̘̗̈͋͋͌̇̓͗̆̇̽̑͂̔̃̉͋͆̔̆͛̋͆͐͂̓̔̀̔͆͐̉̐͌͌̐̒́̊̍̅͋̿́̆͆̀̿̇̈́̔̌̾̿̓̏̄̊̃̆̇̀̊̀́̍̔̇̎͆́̅̅̎́̍̅́͐́́̓͒̊̆̈͂͐͗̃̀̎̏͆͐̋̓͛̓̽̄̃͌̊̆̔̆̍̋͐̔̐͗̄͊̑͂̌̒̄́̌̋̀͛̓̈́̃̑͛͋̍̈́̾̿̓̃̄́̈́̓͗̃̑̏͒͒̅̆͂̈́̂̋̈́̎́͐̌̋͒̒͒͗͋̀̒̒̌̓̒͆̊̂̇̿̿̏̌̃̎́̎̄̾̂̀͌̓͂͑̄̃́̔̀͋̄͊̀̃̒͑̀̿̂͑͑̋̓̽̂̏̐͆̒̒̑̓̌̓̎̆̿̓͊͗́̈̔̏̚̚͘̕̕͘̕͘͘̕͘̕̕̚̕͘̚͜͜͝͠͝͠͝͠͝͝͝͠͝͠͝͝͝͝͠͝͝͝͝͝͝͝ņ̴̡̨̧̨̢̢̧̡̢̨̡̨̧̧̨̢̧̡̧̨̢̧͇̳̹̳̞̯̥̬͍̳̖̮̟̪̲̘͓͓̪̬̱̭̗̩͙̟̰̮̯̳̯͔̺̫̞͙̳̞͔̘͍̼͙̦̠̫̘̪͖̲̗̬̣̩̭̻̖̼͎̤͈̝̱̗͇̖͈͔̲̱͚͕̮͚̱̱̙̤̗̝͙̳̖̪̱̤̪͓͙̼̥͍͔͇͈̦͙͇̤̲̺̯͍̞͍̪̳͍̤̱̺͓͎̤͕̭̖̥͉̞̣̻̳̺̥͎̤͓͓̻̹̝̼̝͓̠͓̣͇͇̱̙̲͚͎̺̯̠̼̗̹̬͚͚͚̺̫͈̞̗̻͖̘̲͎͖̖͓͎̖̠́̋͋̇̇̎̊͑̓̈̾͑͜͜ͅơ̶̧̡̡̨̼͈̼͖͎̘̳̘̰̣̱͔̹͍̟͉͓̰̖̻̗̣͎̭̤̣̫̟̺̫̤͖̘̪͈̜͍̞͕̤̞͈̊̉̀̇͒̀̈̃͒̓̑͂̐͂͗͑̒̈́̂̔͂͒͋́͌̽͑͊̅̊̄͆̒́̔̋͊̈́̋̈́̈͛͘̚͘̚͜͜͠͝͝͝ͅẅ̴̢̧̨̡̢̡̨̧̨̢̢̢̢̧̧̧̡̢̢̧̧̧̡̢̨̧̧̛̛̛̪̱̼͚͓̫̦̲̳̲̪̼͓͎̻͉̬͈͚̯͈̼̰̫̟̲͕̜͕͈̙̖̫̲̤̺̗̠͇̙̠̲͚͔͕̩̪̥̟͙̖͚̭̩̖̺͈̟̗̹̹̤̪̠̜̪̟̙̘͙̫̩̱̻̤̜̹̺͍̭̥̫͖͇̥̗̥͙͙̯͉̪̤̞͕̪̪͚̦̩̭̰̖̠̯̲̖̝̱̰̟̜͈̫͔̩̩̲̟̙̬̯̪͎̺̼̘̱͓̬̗̲̥̖̩͉̭̰͕̻̲͚͓̞̫̼̭̩̼̬̙̥̘̼͎̬̘̠̫̜̩̼͍͈͇͙̤͎̪̗̹͍̳̺̗̗̮̠̠̩̬̤͔̫͓͎̺̩̙̮̞͚̯͈̞͚͖͍̰̰̹͍͔̜̺̥̜̟̩̪͉͈̟̖͍̖͉͓͈̭̦͚̳̙̭̤͍̙̥̮͇͔̯̦̭̟̞̼̥̮̀́̀͌͂̀̓̾̐̐́̒̀̓͗̀̒̋̋̓͐̍̒͂̇͆̓̃͛̉͋̆̀͆̎̇̏́̀̃̈́̌̓͊̉̓́́̔́̇̒̔͊̆̀̇́̀̈́̈́̀̈́̄̈́͆͌͆͆̌̓̓́̽̒͑̒̽̽̓̎̿̍͑̎͌͊͒̈̑̂̓͂̀̃̉̉̐̉̂̒͑̓̅͋̿̆̌͆͗̉̎̅̃̄̂̋̈̍̎̎̾͆̑͆̌̏̀̓̐͆̀͘̚̚͘̕̚͘͘̕̚̕͜͜͜͜͜͝͝͠͝͠͝͠͝͝͠͝͠͠͠͝ͅͅͅ!̸̨̡̛̩̖̪̫̘̟̩̼͓̬̱͖͎̖̣̙͔͇̙̺̯͓̩̙͎͐̀̈́̆͑͗͛̌̉͗̈͂̈́̄̋̉̈́͒͑̀͂́͌͋̽̑͌́͂̆͌͊̆͗̉̿̾̇͂̿̀̽̄̌̈̾̏́̚̚̕̚̚̚͜͝͝͠͠");
  }

  return 0;
}
